# В спотлайт вводим terminal
# ~ - символ домашней директории (папки)
# / - символ корневой директории
# 1)ls(list) - выводит список всех директорий в текущей рабочей директории
# ls -a - выводит список как и скрытых так и обычных директорий и файлов 
# 2)cd(change directory) - меняет текущую директорию на указанную (cd <name_of_директории>)
# cd .. -  1 шаг назад
# 3)touch - создаёт файл (touch <name_of_file>)
# 4)pwd(present working directory) - показывает путь
# 5)mkdir(make directory) - создаёт папки
# rmdir - (remove directory) - удаляет указанную директорию
# 6)rm - удаление файлов
# rm -rf - принудительное удаление файлов
# 7) nano <path_to-file> - открывает графический интерфейс для редактирования файла
# *если нет указанного файла то создамся новый файл
# 8) cat - просмотр выводит содержимое файла



