"""GIT - распределенная система контроля версий"""
#Это система для отслеживания и ведения истории изменения файлов в вашем проекте

# Репозиторий - хранилище вашего кода и истории его изменений

# GIThub-вебсайт для размещения git-рупозиториев и совместной разработки проектов




# команды Git 
# 1) git init= создает новый гит репозиторий локальный на вашем пк
# 2) git commit - как только мы достигаем определенного момента в разработке то тогда мы сохраняем и комментируем изменения
# git commit -m '<comment>'
# 3) git add - когда мы создаем или изменяем файлы то при помощи этой команды мы загружаем все изменения в локальное хранилище(репозиторий)
# git add <file name>
# or
# git add .
# 4) git remote add - команда чтобы связать ваш проект с удаленным репозиторием
# git remote <название подключения>
# 5) git push - после коммита изменений при помощи этой команды мы отправляем наши изменения на удаленный репозиторий
# шgt push <название ветки>



















